In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model

In [2]:
df=pd.read_csv("homeprices.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [6]:
import math
med_bed=math.floor(df.bedrooms.median())
med_bed

4

In [9]:
df.bedrooms=df.bedrooms.fillna(med_bed)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [13]:
x=df.drop(['price'],axis=1)
x

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [15]:
y=df['price']
y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [16]:
model=linear_model.LinearRegression()

model.fit(x,y)

LinearRegression()

In [17]:
model.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [18]:
model.intercept_

221323.00186540408

In [19]:
model.predict([[3000,3,40]])

array([498408.25158031])

In [21]:
112.06244194*3000+23388.88007794*3+-3231.71790863*40 +221323.00186540408

498408.2515740241

# Excercise

In [22]:
df1=pd.read_csv('hiring.csv')
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [24]:
df1.experience=df.experience.fillna(0)
df1

AttributeError: 'DataFrame' object has no attribute 'experience'